#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

[32m[1mSuccess![0m The configuration is valid.
[0m

```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.gke.random_string.cluster_service_account_suffix: Refreshing state... [id=p9rc]
random_id.db_user_pass: Refreshing state... [id=9SrXLzto0M0]
random_id.airflow_webserver_secret: Refreshing state... [id=T1Mpyjd_g7o]
random_id.suffix: Refreshing state... [id=Be8I3MSe-kc]
data.google_service_account_access_token.default: Reading...
data.google_service_account_access_token.default: Read complete after 0s [id=projects/-/serviceAccounts/deb-sa@wizeline-deb.iam.gserviceaccount.com]
data.google_secret_manager_secret_version.argocd_ssh_key_private: Reading...
google_secret_manager_secret.airflow_webserver_secret: Refreshing state... [id=projects/wizeline-deb/secrets/airflow-webserver-secret]
module.cloudresourcemanager_service.google_project_service.project_services["cloudresourcemanager.googleapis.com"]: Refreshing state... [id=wizeline-deb/cloudresourcemanager.googleapis.com]
data.google_client_config.default: Reading...
data.google_service_account.deb-sa: Reading...
google_artifact_registry_repository.docker_repository: Refreshing state... [id=projects/wizeline-deb/locations/us-central1/repositories/deb-capstone-airflow-gke]
data.google_secret_manager_secret_version.airflow_ssh_key_private: Reading...
module.vpc.module.vpc.google_compute_network.network: Refreshing state... [id=projects/wizeline-deb/global/networks/deb-capstone-net]
data.google_client_config.default: Read complete after 0s [id=projects/"wizeline-deb"/regions/"us-central1"/zones/"us-central1-c"]
google_secret_manager_secret_version.airflow_webserver_secret_v1: Refreshing state... [id=projects/734911192367/secrets/airflow-webserver-secret/versions/1]
data.google_service_account.deb-sa: Read complete after 0s [id=projects/wizeline-deb/serviceAccounts/deb-sa@wizeline-deb.iam.gserviceaccount.com]
data.google_secret_manager_secret_version.airflow_ssh_key_private: Read complete after 0s [id=projects/734911192367/secrets/airflow_ssh_key_private/versions/1]
module.gke.data.google_container_engine_versions.region: Reading...
module.vpc.module.subnets.google_compute_subnetwork.subnetwork["us-central1/deb-sub1"]: Refreshing state... [id=projects/wizeline-deb/regions/us-central1/subnetworks/deb-sub1]
google_compute_global_address.private_ip_alloc: Refreshing state... [id=projects/wizeline-deb/global/addresses/private-ip-alloc]
module.gke.google_service_account.cluster_service_account[0]: Refreshing state... [id=projects/wizeline-deb/serviceAccounts/tf-gke-deb-airflow-clu-p9rc@wizeline-deb.iam.gserviceaccount.com]
module.gke.data.google_compute_zones.available: Reading...
data.google_secret_manager_secret_version.argocd_ssh_key_private: Read complete after 0s [id=projects/734911192367/secrets/argocd_ssh_key_private/versions/1]
module.gke.google_project_iam_member.cluster_service_account-log_writer[0]: Refreshing state... [id=wizeline-deb/roles/logging.logWriter/serviceAccount:tf-gke-deb-airflow-clu-p9rc@wizeline-deb.iam.gserviceaccount.com]
google_service_networking_connection.default: Refreshing state... [id=projects%2Fwizeline-deb%2Fglobal%2Fnetworks%2Fdeb-capstone-net:servicenetworking.googleapis.com]
data.google_secret_manager_secret_version.airflow_webserver_secret: Reading...
module.gke.data.google_compute_zones.available: Read complete after 0s [id=projects/wizeline-deb/regions/us-central1]
module.gke.random_shuffle.available_zones: Refreshing state... [id=-]
module.gke.data.google_container_engine_versions.zone: Reading...
module.gke.google_project_iam_member.cluster_service_account-metric_writer[0]: Refreshing state... [id=wizeline-deb/roles/monitoring.metricWriter/serviceAccount:tf-gke-deb-airflow-clu-p9rc@wizeline-deb.iam.gserviceaccount.com]
module.gke.data.google_container_engine_versions.region: Read complete after 1s [id=2023-09-30 13:45:33.55030074 +0000 UTC]
module.gke.google_project_iam_member.cluster_service_account-monitoring_viewer[0]: Refreshing state... [id=wizeline-deb/roles/monitoring.viewer/serviceAccount:tf-gke-deb-airflow-clu-p9rc@wizeline-deb.iam.gserviceaccount.com]
data.google_secret_manager_secret_version.airflow_webserver_secret: Read complete after 1s [id=projects/734911192367/secrets/airflow-webserver-secret/versions/1]
module.gke.data.google_container_engine_versions.zone: Read complete after 1s [id=2023-09-30 13:45:33.784747651 +0000 UTC]
module.gke.google_container_cluster.primary: Refreshing state... [id=projects/wizeline-deb/locations/us-central1/clusters/deb-airflow-cluster-05ef08dcc49efa47]
module.gke.google_project_iam_member.cluster_service_account-resourceMetadata-writer[0]: Refreshing state... [id=wizeline-deb/roles/stackdriver.resourceMetadata.writer/serviceAccount:tf-gke-deb-airflow-clu-p9rc@wizeline-deb.iam.gserviceaccount.com]
null_resource.dependency_setter: Refreshing state... [id=8982907021891562917]
module.sql-db.null_resource.module_depends_on: Refreshing state... [id=864893950696578196]
module.sql-db.google_sql_database_instance.default: Refreshing state... [id=deb-sql-instance-05ef08dcc49efa47]
module.sql-db.google_sql_database.default[0]: Refreshing state... [id=projects/wizeline-deb/instances/deb-sql-instance-05ef08dcc49efa47/databases/default]
module.sql-db.google_sql_database.additional_databases["deb-airflow-db"]: Refreshing state... [id=projects/wizeline-deb/instances/deb-sql-instance-05ef08dcc49efa47/databases/deb-airflow-db]
module.sql-db.random_password.user-password: Refreshing state... [id=none]
module.sql-db.google_sql_user.default[0]: Refreshing state... [id=default//deb-sql-instance-05ef08dcc49efa47]
module.gke.google_container_node_pool.pools["deb-node-pool"]: Refreshing state... [id=projects/wizeline-deb/locations/us-central1/clusters/deb-airflow-cluster-05ef08dcc49efa47/nodePools/deb-node-pool]
helm_release.argocd: Refreshing state... [id=argocd]
kubernetes_namespace.argocd: Refreshing state... [id=argocd]
kubernetes_namespace.airflow: Refreshing state... [id=airflow]
kubernetes_secret.airflow_gcp_connection: Refreshing state... [id=airflow/airflow-gcp-connection]
kubernetes_secret.airflow_ssh_secret: Refreshing state... [id=airflow/airflow-ssh-secret]
kubernetes_secret.airflow_webserver_secret: Refreshing state... [id=airflow/airflow-webserver-secret]
kubernetes_secret.argocd_ssh_secret: Refreshing state... [id=argocd/argocd-ssh-secret]
module.services.google_project_service.project_services["sqladmin.googleapis.com"]: Refreshing state... [id=wizeline-deb/sqladmin.googleapis.com]
module.services.google_project_service.project_services["artifactregistry.googleapis.com"]: Refreshing state... [id=wizeline-deb/artifactregistry.googleapis.com]
module.services.google_project_service.project_services["bigquery.googleapis.com"]: Refreshing state... [id=wizeline-deb/bigquery.googleapis.com]
module.services.google_project_service.project_services["iamcredentials.googleapis.com"]: Refreshing state... [id=wizeline-deb/iamcredentials.googleapis.com]
module.services.google_project_service.project_services["compute.googleapis.com"]: Refreshing state... [id=wizeline-deb/compute.googleapis.com]
module.services.google_project_service.project_services["dataproc.googleapis.com"]: Refreshing state... [id=wizeline-deb/dataproc.googleapis.com]
module.services.google_project_service.project_services["secretmanager.googleapis.com"]: Refreshing state... [id=wizeline-deb/secretmanager.googleapis.com]
module.services.google_project_service.project_services["container.googleapis.com"]: Refreshing state... [id=wizeline-deb/container.googleapis.com]
module.services.google_project_service.project_services["iam.googleapis.com"]: Refreshing state... [id=wizeline-deb/iam.googleapis.com]
module.services.google_project_service.project_services["cloudbuild.googleapis.com"]: Refreshing state... [id=wizeline-deb/cloudbuild.googleapis.com]
google_secret_manager_secret.db_user_pass: Refreshing state... [id=projects/wizeline-deb/secrets/db-user-pass-05ef08dcc49efa47]
module.services.google_project_service.project_services["servicenetworking.googleapis.com"]: Refreshing state... [id=wizeline-deb/servicenetworking.googleapis.com]
module.services.google_project_service.project_services["storage-component.googleapis.com"]: Refreshing state... [id=wizeline-deb/storage-component.googleapis.com]
google_secret_manager_secret_version.db_user_pass: Refreshing state... [id=projects/734911192367/secrets/db-user-pass-05ef08dcc49efa47/versions/1]
data.google_secret_manager_secret_version.db_user_pass: Reading...
data.google_secret_manager_secret_version.db_user_pass: Read complete after 1s [id=projects/734911192367/secrets/db-user-pass-05ef08dcc49efa47/versions/1]
module.sql-db.random_password.additional_passwords["postgres0"]: Refreshing state... [id=none]
kubernetes_secret.airflow_db_connection_secret: Refreshing state... [id=airflow/airflow-db-connection-secret]
module.sql-db.google_sql_user.additional_users["postgres0"]: Refreshing state... [id=postgres0//deb-sql-instance-05ef08dcc49efa47]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.sql-db.google_sql_database_instance.default has changed
  ~ resource "google_sql_database_instance" "default" {
      ~ available_maintenance_versions = [
          + "POSTGRES_15_4.R20230830.01_01",
        ]
        id                             = "deb-sql-instance-05ef08dcc49efa47"
        name                           = "deb-sql-instance-05ef08dcc49efa47"
        # (13 unchanged attributes hidden)

      ~ settings {
          ~ version                     = 1 -> 2
            # (11 unchanged attributes hidden)

            # (4 unchanged blocks hidden)
        }

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # helm_release.argocd will be updated in-place
  ~ resource "helm_release" "argocd" {
        id                         = "argocd"
      ~ metadata                   = [
          - {
              - app_version = "v2.8.4"
              - chart       = "argo-cd"
              - name        = "argocd"
              - namespace   = "argocd"
              - revision    = 2
              - values      = jsonencode(
                    {
                      - server = {
                          - extraArgs = [
                              - "--insecure=false",
                            ]
                          - service   = {
                              - type = "LoadBalancer"
                            }
                        }
                    }
                )
              - version     = "5.46.7"
            },
        ] -> (known after apply)
        name                       = "argocd"
      ~ values                     = [
          - <<-EOT
                server:
                  service:
                    type: LoadBalancer
                  extraArgs:
                    - --insecure=false
                    
                  # additionalApplications:
                  #   - namespace: argocd
                  #     destination:
                  #       namespace: argocd
                  #       server: 'https://kubernetes.default.svc'
                  #     source:
                  #       path: ./argocd-app/app-of-apps
                  #       repoURL: https://github.com/uche-madu/deb-infrastructure/
                  #       targetRevision: HEAD
                  #     project: default
                  #     syncPolicy:
                  #       automated:
                  #         prune: true
                  #         selfHeal: true
                    
                
                
                # configs:
                #   credentialTemplates:
                #     ssh-creds:
                #       url: ssh://git@github.com/uche-madu
                #       sshPrivateKeySecret:
                #         name: ssh-key-secret
                #         key: sshPrivateKey
                
                #   repositories:
                #     deb-infra-repo:
                #       url: ssh://git@github.com/uche-madu/deb-infrastructure.git
                #       type: git
            EOT,
          + <<-EOT
                server:
                  service:
                    type: LoadBalancer
                  extraArgs:
                    - --insecure=false
                
                  # additionalApplications:
                  #   - namespace: argocd
                  #     destination:
                  #       namespace: argocd
                  #       server: 'https://kubernetes.default.svc'
                  #     source:
                  #       path: ./argocd-app/app-of-apps
                  #       repoURL: https://github.com/uche-madu/deb-infrastructure/
                  #       targetRevision: HEAD
                  #     project: default
                  #     syncPolicy:
                  #       automated:
                  #         prune: true
                  #         selfHeal: true
                    
                
                
                # configs:
                #   credentialTemplates:
                #     ssh-creds:
                #       url: git@github.com:uche-madu
                #       sshPrivateKeySecret:
                #         name: ssh-key-secret
                #         key: sshPrivateKey
                
                #   repositories:
                #     deb-infra-repo:
                #       url: git@github.com/uche-madu/deb-infrastructure.git
            EOT,
        ]
        # (26 unchanged attributes hidden)
    }

  # module.gke.google_container_node_pool.pools["deb-node-pool"] must be replaced
-/+ resource "google_container_node_pool" "pools" {
      ~ id                          = "projects/wizeline-deb/locations/us-central1/clusters/deb-airflow-cluster-05ef08dcc49efa47/nodePools/deb-node-pool" -> (known after apply)
      ~ instance_group_urls         = [
          - "https://www.googleapis.com/compute/v1/projects/wizeline-deb/zones/us-central1-c/instanceGroupManagers/gke-deb-airflow-cluster-deb-node-pool-3380b9ac-grp",
        ] -> (known after apply)
      ~ managed_instance_group_urls = [
          - "https://www.googleapis.com/compute/v1/projects/wizeline-deb/zones/us-central1-c/instanceGroups/gke-deb-airflow-cluster-deb-node-pool-3380b9ac-grp",
        ] -> (known after apply)
      ~ max_pods_per_node           = 110 -> (known after apply)
        name                        = "deb-node-pool"
      + name_prefix                 = (known after apply)
      ~ node_count                  = 1 -> (known after apply)
      + operation                   = (known after apply)
      ~ version                     = "1.27.3-gke.100" -> (known after apply)
        # (5 unchanged attributes hidden)

      ~ autoscaling {
          ~ location_policy      = "BALANCED" -> (known after apply)
          - total_max_node_count = 0 -> null
          - total_min_node_count = 0 -> null
            # (2 unchanged attributes hidden)
        }

      - network_config {
          - create_pod_range     = false -> null
          - enable_private_nodes = false -> null
          - pod_ipv4_cidr_block  = "10.10.11.0/24" -> null
          - pod_range            = "deb-sub1-secondary-gke-pods" -> null
        }

      ~ node_config {
          ~ guest_accelerator = [] -> (known after apply)
          + min_cpu_platform  = (known after apply)
          ~ oauth_scopes      = [ # forces replacement
              + "https://www.googleapis.com/auth/devstorage.read_only",
                # (2 unchanged elements hidden)
            ]
          - resource_labels   = {} -> null
            tags              = [
                "gke-deb-airflow-cluster-05ef08dcc49efa47",
                "gke-deb-airflow-cluster-05ef08dcc49efa47-deb-node-pool",
            ]
          ~ taint             = [] -> (known after apply)
            # (11 unchanged attributes hidden)

            # (2 unchanged blocks hidden)
        }

      ~ upgrade_settings {
            # (3 unchanged attributes hidden)
        }

        # (2 unchanged blocks hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.

Changes to Outputs:
  ~ gke_cluster_name          = "deb-airflow-cluster-05ef08dcc49efa47" -> (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @uche-madu, Action: `pull_request`, Working Directory: `./terraform`, Workflow: `Terraform Workflow`*